[
  {
    "title": "Saint-Gobain Careers",
    "description": "A site built for recruiting talent at Saint-Gobain's North American division. This site was a custom WordPress build, using Swagger and Google Maps APIs to create an interactive map to filter through listings.",
    "link": "https://careers.saint-gobain-northamerica.com/",
    "desktop": "images/work/sgcareers_desktop.jpg",
    "mobile": "images/work/sgcareers_mobile.jpg"
  },
  {
    "title": "BG Holiday Ad-Lib",
    "description": "A madlib-style game based on agency life, done as self-promotion for Brownstein Group. This is a custom web app I built in PHP.",
    "link": "http://happyholidaysfrom.brownstein.group",
    "desktop": "images/work/mablib-desktop.jpg",
    "mobile": "images/work/mablib-mobile.png"
  },
  {
    "title": "Giant Heirloom Market",
    "description": "A microsite built to promote Giant's Heirloom Market. I built this site using flexible content in WordPress to allow completely new page types to be built without new code.",
    "link": "https://www.heirloommarket.com/",
    "desktop": "images/work/heirloom_desktop.jpg",
    "mobile": "images/work/heirloom_mobile.jpg"
  },
  {
    "title": "Xfinity Mobile Phone Cleanse",
    "description": "A site built for Xfinity to promote healthier smartphone habits. I built this site as static HTML/CSS using JSON to easily manage content.",
    "link": "https://www.xfinity.com/mobile/landing/phone-cleanse",
    "desktop": "images/work/phone_cleanse_desktop.jpg",
    "mobile": "images/work/phone_cleanse_mobile.jpg"
  },
  {
    "title": "Brownstein Group",
    "description": "A redesign of Brownstein Group's website, I developed this as a custom WordPress theme that allows for lots of flexibility. It emphasises typography and basic geometry instead of relying on images to make interesting layouts.",
    "link": "http://www.brownsteingroup.com",
    "desktop": "images/work/bg_desktop.jpg",
    "mobile": "images/work/bg_mobile.jpg"
  },
  {
    "title": "NOVA by Saint-Gobain",
    "description": "A new site for Saint-Gobain's external ventures team aimed at sustainable startups. I built this site in Drupal, using modular templates I created to allow new pages to be made quickly with lots of different configurations.",
    "link": "https://www.nova-saint-gobain.com/",
    "desktop": "images/work/nova_desktop.jpg",
    "mobile": "images/work/nova_mobile.jpg"
  },
  {
    "title": "Wonder Ball",
    "description": "After Frankford Candy brought back Wonder Ball, they needed a new website to go along with it. I built this with WordPress, collaborating with Brownstein Group's video production team to integrate stop motion animation to showcase different varieties of the product.",
    "link": "http://www.wonderballcandy.com/",
    "desktop": "images/work/wonderball_desktop.jpg",
    "mobile": "images/work/wonderball_mobile.jpg"
  },
  {
    "title": "National Lacrosse League",
    "description": "A complete redesign and rebuild of the NLL website. I made this site using WordPress, collaborating with PointStreak Technologies to integrate live stats for players, games, and teams.",
    "link": "http://www.nll.com/",
    "desktop": "images/work/nll_desktop.jpg",
    "mobile": "images/work/nll_mobile.jpg"
  },
  {
    "title": "SageGlass",
    "description":  "SageGlass is a type of glass that you can tint on demand. This site was designed to simulate the features of their products, using background video and CSS animations. I programmed the layouts, and collaborated with another developer to tie it into the Drupal platform.",
    "link": "https://www.sageglass.com",
    "desktop": "images/work/sage_desktop.jpg",
    "mobile": "images/work/sage_mobile.jpg"
  },
  {
    "title": "DuPont Sorona",
    "description":  "Sorona creates unique synthetic fabrics for all kinds of uses. I built this site using HTML/CSS, using font sizes to influence the distance travelled in keyframes so the animations could be both extremely lightweight and varied at the same time. This was deployed through the Eloqua platform.",
    "link": "http://sorona.com/",
    "desktop": "images/work/sorona_desktop.jpg",
    "mobile": "images/work/sorona_mobile.jpg"
  },
  {
    "title": "DuPont Intexar",
    "description": "A new product line from DuPont, Intexar creates technology used by clothing manufacturers to provide functionalities like heating and health monitoring. I lead development on the site, which was built for the Eloqua platform.",
    "link": "http://electronicmaterials.dupont.com/intexar-heat",
    "desktop": "images/work/intexar_desktop.jpg",
    "mobile": "images/work/intexar_mobile.jpg"
  },
  {
    "title": "Mural Finder",
    "description": "A web app developed for the Mural Arts Foundation to help people find the murals all over Philly. This app was built with Ruby on Rails - I worked on the Google Maps integration and layouts.",
    "link": "https://map.muralarts.org/",
    "desktop": "images/work/muralarts_desktop.jpg",
    "mobile": "images/work/muralarts_mobile.jpg"
  },
  {
    "title": "IKEA LED Challenge",
    "description": "A game developed to show how much energy you can save by switching to LED bulbs. This was released in tandem with IKEA's sustainability month. I programmed the gameplay and animations for this mobile and desktop compatible game.",
    "link": "http://www.taketheledchallenge.com/",
    "desktop": "images/work/led_desktop.jpg",
    "mobile": "images/work/led_mobile.jpg"
  },
  {
    "title": "The Philadelphia Citizen",
    "description": "A site that highlights issues in Philadelphia and what the community can do to address them. I lead the front end programming, animation, and interactivity seen throughout the site.",
    "link": "http://thephiladelphiacitizen.org/",
    "desktop": "images/work/citizen_desktop.jpg",
    "mobile": "images/work/citizen_mobile.jpg"
  },
  {
    "title": "A Vague Christmas",
    "description": "A Christmas card for the Vague family, I animated and programmed this elaborate Christmas experience.",
    "link": "http://vaguechristmas.com/",
    "desktop": "images/work/vague_desktop.jpg"
  },
  {
    "title": "Speedpay",
    "description": "An informational site for Western Union's bill payment services. I built this site using ExpressionEngine.",
    "link": "https://payments.westernunion.com/",
    "desktop": "images/work/payments_desktop.jpg",
    "mobile": "images/work/payments_mobile.jpg"
  },
  {
    "title": "Philadelphia Federal Credit Union",
    "description": "A redesign of Philadelphia Federal Credit Union's website. I handled the majority of the front-end programming, animations, and interactivity.",
    "link": "https://www.pfcu.com/",
    "desktop": "images/work/pfcu_desktop.jpg",
    "mobile": "images/work/pfcu_mobile.jpg"
  }
]
